tests/Fixtures/pia-ndc/doAirShopping_OW_req.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.iata.org/IATA/2015/00/2020.1/IATA_AirShoppingRQ">
   <SOAP-ENV:Body>
      <ns1:IATA_AirShoppingRQ>
         <ns1:MessageDoc>
            <ns1:RefVersionNumber>20.1</ns1:RefVersionNumber>
         </ns1:MessageDoc>
         <ns1:Party>
            <ns1:Sender>
               <ns1:TravelAgency>
                  <AgencyID>SELENS</AgencyID>
               <ns1:AgencyID/></ns1:TravelAgency>
            </ns1:Sender>
         </ns1:Party>
         <ns1:Request>
            <ns1:FlightRequest>
               <OriginDestCriteria>
                  <DestArrivalCriteria>
                     <IATA_LocationCode>ISB</IATA_LocationCode>
                  </DestArrivalCriteria>
                  <OriginDepCriteria>
                     <Date>2025-05-28</Date>
                     <IATA_LocationCode>KHI</IATA_LocationCode>
                  </OriginDepCriteria>
                  <PreferredCabinType>
                     <CabinTypeCode>Y</CabinTypeCode>
                  </PreferredCabinType>
               </OriginDestCriteria>
            </ns1:FlightRequest>
            <ns1:Paxs>
               <ns1:Pax>
                  <ns1:PaxID>SH1</ns1:PaxID>
                  <ns1:PTC>ADT</ns1:PTC>
               </ns1:Pax>
                <ns1:Pax>
                  <ns1:PaxID>SH2</ns1:PaxID>
                  <ns1:PTC>CHD</ns1:PTC>
               </ns1:Pax>
                <ns1:Pax>
                  <ns1:PaxID>SH3</ns1:PaxID>
                  <ns1:PTC>INF</ns1:PTC>
               </ns1:Pax>
           
            </ns1:Paxs>
            <ns1:ResponseParameters>
               <ns1:CurParameter>
                  <ns1:RequestedCurCode>PKR</ns1:RequestedCurCode>
               </ns1:CurParameter>
               <ns1:LangUsage>
                  <ns1:LangCode>EN</ns1:LangCode>
               </ns1:LangUsage>
            </ns1:ResponseParameters>
            <ns1:ShoppingCriteria>
               <ns1:ConnectionCriteria>
                  <ns1:ConnectionPrefID/>
                  <ns1:InterlineInd>false</ns1:InterlineInd>
                  <ns1:StationCriteria/>
               </ns1:ConnectionCriteria>
            </ns1:ShoppingCriteria>
         </ns1:Request>
      </ns1:IATA_AirShoppingRQ>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>